var egg_group = [
[1, "怪兽", "", "", "像是怪兽一样，或者比较野性。"],
[2, "人型", "", "", "两足行走。"],
[3, "水中1", "", "", "可以两栖或多栖。"],
[4, "水中2", "", "", "像是鱼一类的脊椎动物。"],
[5, "水中3", "", "", "水中无脊椎动物。"],
[6, "虫", "", "", "外表长得像虫子。"],
[7, "矿物", "", "", "结晶或硅基生物。"],
[8, "飞行", "", "", "外表长得像鸟。"],
[9, "不定形", "", "", "没有固定外表。"],
[10, "陆上", "", "", "最大的蛋群，住在陆地上的神奇宝贝基本都属于这个群。"],
[11, "妖精", "", "", "个子比较小或者比较可爱。"],
[12, "植物", "", "", "外表长得像植物。"],
[13, "龙", "", "", "外表长得像龙。"],
[14, "百变怪", "", "", "百变怪是这个群中唯一一只神奇宝贝，可以和除了未发现群以外的所有神奇宝贝生蛋（无视性别）。"],
[15, "未发现", "", "", "NULL不能和任何神奇宝贝生蛋。"],
[16, "性别不明", "", "", "如果神奇宝贝没有性别，又不属于百变怪、未发现蛋群，则被归入其中。"]
]